FDForerver/HT32F52352/HT32_Onenet_MQTT/Library/src/ht32f65230_40_adc.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the specified PDMA request.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_PDMA_x: Specify the ADC PDMA request that is to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg ADC_PDMA_REGULAR_SINGLE   :
 *     @arg ADC_PDMA_REGULAR_SUBGROUP :
 *     @arg ADC_PDMA_REGULAR_CYCLE    :
 *     @arg ADC_PDMA_HP_SINGLE        :
 *     @arg ADC_PDMA_HP_SUBGROUP      :
 *     @arg ADC_PDMA_HP_CYCLE         :
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_PDMAConfig(HT_ADC_TypeDef* HT_ADCn, u32 ADC_PDMA_x, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_ADC_PDMA(ADC_PDMA_x));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_ADCn->PDMAR |= ADC_PDMA_x;
  }
  else
  {
    HT_ADCn->PDMAR &= ~ADC_PDMA_x;
  }
}

/*********************************************************************************************************//**
 * @brief Configure the ADC1 regular trigger source same as the ADC0 with 0 to 255 clocks delay.
 * @param ADC_TrigDelay: Number of delay clocks.
     This parameter must be between 0x00 to 0xFF.
 * @retval None
 ************************************************************************************************************/
void ADC1_RegularTrigDelayConfig(u32 ADC_TrigDelay)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC_TRIG_DELAY(ADC_TrigDelay));

  HT_ADC1->CFGR = (ADC_TrigDelay << 8) | 0x40 | 0x01;
}

/*********************************************************************************************************//**
 * @brief Configure the ADC1 high priority trigger source same as the ADC0 with 0 to 255 clocks delay.
 * @param ADC_TrigDelay: Number of delay clocks.
     This parameter must be between 0x00 to 0xFF.
 * @retval None
 ************************************************************************************************************/
void ADC1_HPTrigDelayConfig(u32 ADC_TrigDelay)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC_TRIG_DELAY(ADC_TrigDelay));

  HT_ADC1->CFGR = (ADC_TrigDelay << 16) | 0x40 | 0x03;
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
